In [50]:
import pandas as pd
import numpy as np
ser1=pd.Series(data=[1,2,3,4],index=['CA','OR','CO','CZ'])
ser1

CA    1
OR    2
CO    3
CZ    4
dtype: int64

In [51]:
print("value for CA in ser1",ser1['CA'])

value for CA in ser1 1

In [52]:
print("value for CA in ser1",ser1[0])

value for CA in ser1 1

In [53]:
print("value for CA in ser1",ser1['OR'])

value for CA in ser1 2

In [54]:
print("value for CA in ser1",ser1[3])

value for CA in ser1 4

In [55]:
print(ser1[1:4])

OR    2
CO    3
CZ    4
dtype: int64

In [56]:
ser1=pd.Series([1,2,3,4,10],['CA','OR','CO','CZ','LA'])
ser2=pd.Series(data=[1,2,3,4,30],index=['CA','LA','CO','CZ','NZ'])
print(ser1)
print(ser2)

CA     1
OR     2
CO     3
CZ     4
LA    10
dtype: int64
CA     1
LA     2
CO     3
CZ     4
NZ    30
dtype: int64

In [57]:
ser3 = ser1 + ser2

print(ser3)

CA     2.0
CO     6.0
CZ     8.0
LA    12.0
NZ     NaN
OR     NaN
dtype: float64

# DATAFRAME MANIPULATION

In [58]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')

In [59]:
row_labels = ['RAJU','PANDEY','HARISH','SHYAM','MIKE']
col_heading = ['Age','Height','Weight']
df = pd.DataFrame(data=matrix_data,index=row_labels,columns = col_heading)
df

        Age  Height  Weight
RAJU     22      66     140
PANDEY   42      70     148
HARISH   30      62     125
SHYAM    35      68     160
MIKE     25      62     152

In [60]:
ht_wt = df[['Height','Weight']]#if there we need Aage then we must used [[['Height','Weight','Age']]]
ht_wt

        Height  Weight
RAJU        66     140
PANDEY      70     148
HARISH      62     125
SHYAM       68     160
MIKE        62     152

In [61]:
df.Age

RAJU      22
PANDEY    42
HARISH    30
SHYAM     35
MIKE      25
Name: Age, dtype: int32

In [62]:
df['Age']

RAJU      22
PANDEY    42
HARISH    30
SHYAM     35
MIKE      25
Name: Age, dtype: int32

using loc and iloc

In [63]:
df.loc['RAJU']

Age        22
Height     66
Weight    140
Name: RAJU, dtype: int32

In [64]:
df.iloc[0]

Age        22
Height     66
Weight    140
Name: RAJU, dtype: int32

In [65]:
df.loc ['PANDEY','Height']

70

In [66]:
df.loc['MIKE',['Height','Weight']]

Height     62
Weight    152
Name: MIKE, dtype: int32

In [67]:
df.loc[['HARISH','SHYAM'],['Height','Weight']]

        Height  Weight
HARISH      62     125
SHYAM       68     160

->SELECT DATA ON CONDITION

In [68]:
df[df['Height']>65]

        Age  Height  Weight
RAJU     22      66     140
PANDEY   42      70     148
SHYAM    35      68     160

In [70]:
df1 = df['Height']>65
df2 = df['Weight']>145
df[(df1)&(df2)]

        Age  Height  Weight
PANDEY   42      70     148
SHYAM    35      68     160

In [71]:
df[df1][['Age','Weight']]

        Age  Weight
RAJU     22     140
PANDEY   42     148
SHYAM    35     160

In [72]:
df[df2][['Age','Weight']]

        Age  Weight
PANDEY   42     148
SHYAM    35     160
MIKE     25     152

->RESETTING INDEX

In [73]:
df.reset_index()

    index  Age  Height  Weight
0    RAJU   22      66     140
1  PANDEY   42      70     148
2  HARISH   30      62     125
3   SHYAM   35      68     160
4    MIKE   25      62     152

In [74]:
df.set_index('Age')

     Height  Weight
Age
22       66     140
42       70     148
30       62     125
35       68     160
25       62     152

In [75]:
df

        Age  Height  Weight
RAJU     22      66     140
PANDEY   42      70     148
HARISH   30      62     125
SHYAM    35      68     160
MIKE     25      62     152